src/config/DataProcessors/ПроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ПроведениеПоПартиям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКонцаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/InformationRegisters/СписанныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СписанныеТовары</Name>
			<Comment>(Общ) Содержит данные документов, необходимые для выполнения движений, связанных со списанием партий товаров</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВозвратОтПокупателяДокументПартии</Name>
					<Comment>(Общ) Документ партии (документ поставки, документ реализации), указанный при возврате от покупателя</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ) договор контрагента документов передачи на комиссию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Comment>(Общ) Документ, по которому товар передан на комиссию</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйСтатус1</Name>
					<Comment>(Упр) Допустимый статус партии для списания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйСтатус2</Name>
					<Comment>(Упр) Допустимый статус партии для списания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйСтатус3</Name>
					<Comment>(Упр) Допустимый статус партии для списания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйСтатус4</Name>
					<Comment>(Упр) Допустимый статус партии для списания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимыйСтатусПередачи</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПолученияПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказПартии</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказСписания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КачествоНовое</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперацииПартииТоваров</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеПриходныйОрдер</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатурыНовая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьСторнированием</Name>
					<Comment>(Общ) Признак того, что списание выполняется при помощи поступления со знаком "-"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьТолькоПоЗаказу</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПередачи</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПолученияПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоступление</Name>
					<Comment>(Общ) Стоимость с которой приходуется партия товаров (при переоценке принятых на комиссию товаров)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженностиБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатурыНовая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорВалютаЗадолженностиБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорВалютнаяСуммаЗадолженностиБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоступление</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатураНовая</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОприходованияНовый</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоступлениеБУ</Name>
					<Comment>(Регл) Стоимость с которой приходуется партия товаров (при переоценке принятых на комиссию товаров)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеСписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/DataProcessors/ПроведениеПоПартиям/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОСНОВНАЯ ПРОЦЕДУРА ОБРАБОТКИ
Функция ПолучитьГраницуПоследовательности(Организация = Неопределено) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартионныйУчетГраницы.МоментВремени
	|ИЗ
	|	Последовательность.ПартионныйУчет.Границы КАК ПартионныйУчетГраницы
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.МоментВремени;
	Иначе
		Возврат Новый МоментВремени('00010101');
	КонецЕсли;

КонецФункции // ПолучитьГраницуПостедовательности(Задача)

Процедура ВыполнитьВосстановление() Экспорт

	// Константа, определяющая количество выбираемых строк в выборках
	
	//1 "порция" для 1 транзакции - 1000 строк товаров может доходить до 1000 документов?!
	КоличествоСтрокЗаПроход = 1000;
   	
	// Будем обрабатывать документы с минимальной из границ
	Запрос = Новый Запрос;
	Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ
	"ВЫБРАТЬ  * ИЗ
	|( ";
	ТекстВложенногоЗапроса=  "";
	Если Не ПустаяСтрока(ТекстВложенногоЗапроса) Тогда
		ТекстВложенногоЗапроса = ТекстВложенногоЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ ";
	КонецЕсли;
	
	ТекстВложенногоЗапроса = ТекстВложенногоЗапроса + "
	|ВЫБРАТЬ
	|	ПартионныйУчетГраницы.МоментВремени КАК МоментВремени
	|ИЗ
	|	Последовательность.ПартионныйУчет.Границы КАК ПартионныйУчетГраницы
	|";
	
	Текст = Текст + ТекстВложенногоЗапроса + "
	|) ВложенныйЗапрос
	|УПОРЯДОЧИТЬ ПО МоментВремени ВОЗР";
	
	Запрос.Текст = Текст;
	
	ВыборкаГраниц = Запрос.Выполнить().Выбрать();
	Если ВыборкаГраниц.Следующий() Тогда
		ГПт = ВыборкаГраниц.МоментВремени;
	Иначе
		ГПт = Новый МоментВремени('00010101');
	КонецЕсли;
	
		Пока ВыборкаГраниц.Следующий() цикл
		Если ВыборкаГраниц.МоментВремени.Дата< Дата("20170302000000") тогда
			продолжить;
		иначе	
		ГПт = ВыборкаГраниц.МоментВремени;
		прервать;
		конецЕсли;	
	
	
	конецЦикла;

	
	
	// Восстанавливаем обе последовательности, последовательно проводя документы
	ЕстьДокументы = Истина;
	
	ПоследнийОбработанныйДокумент = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	ОбработаноСтрок = 0; ОбработаноДокументов = 0;
	
	НачатьТранзакцию(); //----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Начало транзакции");
		Сообщить( строка(ТекущаяДата())+" - начало выполнения обработки ""Проведение по партиям"".");
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Начало транзакции.";
	#Иначе
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Начало транзакции.";
	#КонецЕсли
	
	Пока ЕстьДокументы Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Выборка документов для проведения.");
			ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Выборка документов для проведения.";
		#Иначе
			ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Выборка документов для проведения.";
		#КонецЕсли
		
		СписокДокументов = ПолучитьСписокДокументов(ПоследнийОбработанныйДокумент, ГПт.Дата, ГПт.Ссылка, КонецДня(ДатаКонцаОбработки));
	//	СписокДокументов = ПолучитьСписокДокументов(ПоследнийОбработанныйДокумент, ГПт.Дата, ГПт.Ссылка, ДобавитьМесяц(ГПт.Дата,4));
		ЕстьДокументы = Ложь;
		
		НаборЗаписейРегистрации = Последовательности.ПартионныйУчет.СоздатьНаборЗаписей();
		N = СписокДокументов.Количество(); 
		Для каждого Строка Из СписокДокументов Цикл
			
			Документ = Строка.Ссылка;
			
			#Если Клиент Тогда
				ОбработкаПрерыванияПользователя();
				Состояние("Обрабатывается документ: "+строка(Документ));
			#КонецЕсли	
			
			ЕстьДокументы = Истина;
			
			// Через параметр получим количество обработанных строк
			КоличествоСтрокВДокументе = 0;
			
			
			// Проводим только по тем видам учета, которые указаны в документе
			Упр = Строка.ОтражатьВУправленческомУчете;
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеЗаказовПокупателей") Тогда
				//  продолжить;

				////#Если Клиент Тогда
				////	Состояние("Проведение документа " + Документ);
				////#КонецЕсли
				//
				//ТаблицаСписания = ПолучитьТаблицуСтрокЗакрытиеЗаказовПокупателей(Документ);
				//Если ТаблицаСписания.Количество() <> 0 Тогда				
				//
				//	// Движение партий товаров по документу
				//	ДвижениеПартийТоваров(Документ, ТаблицаСписания, КоличествоСтрокВДокументе);
				//	
				//	//ДокументМоментВремени = Новый МоментВремени(Строка.Дата, Строка.Ссылка);
				//	//
				//	//// Установка границы на последний обработанный документ
				//	//НаборЗаписейРегистрации.Отбор.Регистратор.Установить(Строка.Ссылка);
				//	//ЗаписьРегистрации = НаборЗаписейРегистрации.Добавить();
				//	//ЗаписьРегистрации.Период = Строка.Дата;
				//	//НаборЗаписейРегистрации.Записать(Истина);
				//	//
				//	//// Если обработано, тогда устанавливаем границу обработки товаров на момент документа по соответсвующему учету
				//	//Последовательности.ПартионныйУчет.УстановитьГраницу(ДокументМоментВремени);
				//
				//КонецЕсли;
				//
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				
					//#Если Клиент Тогда
					//	Состояние("Проведение документа " + Документ);
					//#КонецЕсли
					
					//***Федорова 
					// Таблица строк документов списания
					ТаблицаДокумента = ПолучитьТаблицуСтрокДокументов(Документ);
					
					Если ТаблицаДокумента.Количество() <> 0 Тогда
						
						для каждого стр1 из ТаблицаДокумента цикл
							скл = Документ.Товары[стр1.НомерСтроки-1].Склад;
							Если ЗначениеЗаполнено(Документ.ВнутреннийЗаказ) тогда
								стр1.Склад = ?(ЗначениеЗаполнено(скл), скл, Документ.СкладОтправитель);   // склад отправитель в таб.части
							иначе
								стр1.СкладПолучатель = ?(ЗначениеЗаполнено(скл), скл, Документ.СкладПолучатель);   // склад получатель в таб.части
							КонецЕсли;	
						КонецЦикла;	
						
						ДвижениеПартийТоваров(Документ, ТаблицаДокумента, КоличествоСтрокВДокументе);
						
					Иначе
						
						// Движение партий товаров по документу
						ДвижениеПартийТоваров(Документ, , КоличествоСтрокВДокументе);
						
					КонецЕсли;
					
					//ДокументМоментВремени = Новый МоментВремени(Строка.Дата, Строка.Ссылка);
					//
					//// Установка границы на последний обработанный документ
					//
					//НаборЗаписейРегистрации.Отбор.Регистратор.Установить(Строка.Ссылка);
					//ЗаписьРегистрации = НаборЗаписейРегистрации.Добавить();
					//ЗаписьРегистрации.Период = Строка.Дата;
					//НаборЗаписейРегистрации.Записать(Истина);
					//
					//Последовательности.ПартионныйУчет.УстановитьГраницу(ДокументМоментВремени);
				
			Иначе
				
					//#Если Клиент Тогда
					//	Состояние("Проведение документа " + Документ);
					//#КонецЕсли
					
					// Движение партий товаров по документу
					//+++ 27.04.2016 +++++++++++для АЭ - меняется подразделение в движениях ++++++++++++++++++++++++++++++
					Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
						и Документ.Дата >= '20180101' тогда
						// как в модуле реализации - Плотников
					//	Если Документ.Контрагент.КонтрагентДляРезерваИМ <> Справочники.Контрагенты.ПустаяСсылка() Тогда
							ТабДокумента = ПолучитьТаблицуСтрокДокументов(Документ);
							ТабДокумента.ЗаполнитьЗначения(Документ.ПодразделениеДохода, "Подразделение");
							ДвижениеПартийТоваров(Документ, ТабДокумента, КоличествоСтрокВДокументе);
						//Иначе  // как было
						//	ДвижениеПартийТоваров(Документ, , КоличествоСтрокВДокументе);
						//КонецЕсли;
					//	
					Иначе  // как было
						ДвижениеПартийТоваров(Документ, , КоличествоСтрокВДокументе);
					КонецЕсли;
					
					
					//ДокументМоментВремени = Новый МоментВремени(Строка.Дата, Строка.Ссылка);
					//
					//// Установка границы на последний обработанный документ
					//
					//НаборЗаписейРегистрации.Отбор.Регистратор.Установить(Строка.Ссылка);
					//ЗаписьРегистрации = НаборЗаписейРегистрации.Добавить();
					//ЗаписьРегистрации.Период = Строка.Дата;
					//НаборЗаписейРегистрации.Записать(Истина);
					//
					//Последовательности.ПартионныйУчет.УстановитьГраницу(ДокументМоментВремени);
					
			КонецЕсли;
			 			//#Если Клиент Тогда
			//Состояние();
			//#КонецЕсли
			
			ПоследнийОбработанныйДокумент = Документ;
			
			ОбработаноСтрок = ОбработаноСтрок + КоличествоСтрокВДокументе; //+++ 26.11.2014 - количество документов, а не строк в документе... 
			ОбработаноДокументов = ОбработаноДокументов + 1;
			
			// Фиксируем транзакции обработки КоличествоСтрокЗаПроход строк
			Если ОбработаноСтрок>=КоличествоСтрокЗаПроход Тогда
				
				#Если Клиент Тогда
					Состояние("Обработано "+строка(ОбработаноДокументов)+" документов. Фиксация транзакции на документе "+строка(ПоследнийОбработанныйДокумент));
				#КонецЕсли
				ОбработаноСтрок = 0;
				
				ЗафиксироватьТранзакцию();
				
				НачатьТранзакцию();
				
			КонецЕсли;
		
		КонецЦикла;			
	
	КонецЦикла;
	
	#Если Клиент Тогда
		Состояние("Фиксация транзакции "+строка(ПоследнийОбработанныйДокумент));
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Фиксация транзакции.";
	#Иначе
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " Фиксация транзакции.";
	#КонецЕсли
	
	ЗафиксироватьТранзакцию();
	
	#Если Клиент Тогда
		Состояние(" ");
		Сообщить( строка(ТекущаяДата())+" - обработано "+ строка(ОбработаноДокументов)+" документов. Выполнение ""Проведения по партиям"" завершено.");
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " обработано " + строка(ОбработаноДокументов)+" документов. Выполнение ""Проведения по партиям"" завершено.";
	#Иначе
		ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания = ПараметрыСеанса.ПроведениеПоПартиямОшибкиРеглЗадания + Символы.ПС + " обработано " + строка(ОбработаноДокументов)+" документов. Выполнение ""Проведения по партиям"" завершено.";
	#КонецЕсли
	
	Если НЕ ПараметрыСеанса.ПроведениеПоПартиямДатаПервойОшибки = Дата(1,1,1) Тогда
		Последовательности.ПартионныйУчет.УстановитьГраницу(ПараметрыСеанса.ПроведениеПоПартиямДатаПервойОшибки-1);
	иначе
		ДокументМоментВремени = Новый МоментВремени(ПоследнийОбработанныйДокумент.Дата, ПоследнийОбработанныйДокумент.Ссылка);
       	Последовательности.ПартионныйУчет.УстановитьГраницу(ДокументМоментВремени);

	КонецЕсли;
	
КонецПроцедуры // ВыполнитьВосстановлениеПоследовательностей()

Функция ПолучитьТаблицуСтрокЗакрытиеЗаказовПокупателей(ДокументСписания)
	
	// Общая часть запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСписания", ДокументСписания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""ПолучитьТаблицуСтрокДокументов"" КАК QuieryId ";
	
	Ресурсы = Метаданные.РегистрыСведений.СписанныеТовары.Ресурсы;
	
	Для каждого Ресурс Из Ресурсы Цикл
		
		Запрос.Текст = 	Запрос.Текст + ",
		|	"+ Ресурс.Имя;
		
	КонецЦикла; 
	
	Запрос.Текст = 	Запрос.Текст + ",
	|	Регистратор,
	|	Период,
	|	НомерСтроки
	|ИЗ
	|	РегистрСведений.СписанныеТовары КАК Строки
	|
	|ГДЕ
	|	1=1
	|";
	
	
	Запрос.Текст = Запрос.Текст+ "
		|	И Строки.Регистратор = &ДокументСписания";
	Запрос.Текст = Запрос.Текст+ "
		|	И Строки.ОтражатьВУправленческомУчете = Истина";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();

КонецФункции

// Возвращает таблицу документов
//
// Параметры
//  ДатаНач,
//	ДатаНач         – даты начала и конца периода
//                 <продолжение описания параметра>
//  МассивНоменклатуры – массив для ограничения номенклатуры
//  МассивХарактеристикНоменклатуры – массив для ограничения номенклатуры
//  МассивСерийНоменклатуры – массив для ограничения номенклатуры
//
// Возвращаемое значение:
//   Таблица строк документов
//
Функция ПолучитьТаблицуСтрокДокументов(ДокументСписания=Неопределено, ДатаНач=Неопределено, ДатаКон=Неопределено, МассивНоменклатуры=Неопределено)
	
	// Общая часть запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСписания", ДокументСписания);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""ПолучитьТаблицуСтрокДокументов"" КАК QuieryId ";
	
	Ресурсы = Метаданные.РегистрыСведений.СписанныеТовары.Ресурсы;
	
	Для каждого Ресурс Из Ресурсы Цикл
		
		Запрос.Текст = 	Запрос.Текст + ",
		|	"+ Ресурс.Имя;
		
	КонецЦикла; 
	
	Запрос.Текст = 	Запрос.Текст + ",
	|	Регистратор,
	|	Период,
	|	НомерСтроки
	|ИЗ
	|	РегистрСведений.СписанныеТовары КАК Строки
	|
	|ГДЕ
	|	1=1
	|";
	
	Если ДатаНач <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст+ "
		|	И Строки.Период МЕЖДУ &ДатаНач И &ДатаКон ";
	
	КонецЕсли; 
	
	Если ДокументСписания <> Неопределено Тогда
	
		Запрос.Текст = Запрос.Текст+ "
		|	И Строки.Регистратор = &ДокументСписания";
	
	КонецЕсли; 
	
	Если МассивНоменклатуры<>Неопределено Тогда
		
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);

		Запрос.Текст = Запрос.Текст+ "
		|	И Строки.Номенклатура В (&МассивНоменклатуры)";
	
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();

КонецФункции
